export const messageText = {
  startSearch: "Начните поиск фильмов",
  notFound: "Ничего не найдено",
  searchError:
    "Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз",
};

export const alertText = {
  searchIsEmpty: "Нужно ввести ключевое слово",
  name: "Введите значение от 3 до 50 символов",
  email: "Значение не соответствует адресу e-mail",
  password: "Значение должно состоять из латинских символов, цифр и спецсимволов",
  serverError: "Ошибка сервера",
  authorizationError: "Ошибка авторизации",
  profileUpdated: "Данные пользователя обновлены",
  userExists: "Пользователь с таким адресом уже существует"
}
